In [1]:
import numpy as np
import pandas as pd

import dask.dataframe as dd
import dask.array as da
import dask.bag as db

In [3]:
bakong_data = pd.read_csv('dataset/bakong_data_1m.csv')
aba_data = pd.read_csv('dataset/aba_data_1m.csv')

<hr>
Clean Bakong Data
<hr>

In [4]:
bakong_data.tail()

,dt,src_name,MerchantName,total_trnx,total_usd_amount
999994,2023-12-01T00:00,SAMBATH NOY,LORN SOUTH,1,43.000
999995,2023-12-01T00:00,CHHANG POR,LORN SOVAN RAKSMEY,1,0.200
999996,2023-12-01T00:00,CHHI CHHI BO,LORN SREY LEAK,1,3.000
999997,2023-12-01T00:00,SREY LEAK LORN,LORN SREY LEAK,7,6.675
999998,2023-12-01T00:00,SAVIN DAN,LORN SREY LEAK,1,2.500

In [5]:
bakong_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999999 entries, 0 to 999998
Data columns (total 5 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   dt                999999 non-null  object
 1   src_name          999999 non-null  object
 2   MerchantName      999941 non-null  object
 3   total_trnx        999999 non-null  int64
 4   total_usd_amount  999999 non-null  float64
dtypes: float64(1), int64(1), object(3)
memory usage: 38.1+ MB

In [6]:
bakong_data['src_name'] = bakong_data['src_name'].str.upper()
bakong_data['src_name'] = bakong_data['src_name'].str.strip()
bakong_data['src_name'] = bakong_data['src_name'].str.replace(" ", "")

In [7]:
bakong_data.tail()

,dt,src_name,MerchantName,total_trnx,total_usd_amount
999994,2023-12-01T00:00,SAMBATHNOY,LORN SOUTH,1,43.000
999995,2023-12-01T00:00,CHHANGPOR,LORN SOVAN RAKSMEY,1,0.200
999996,2023-12-01T00:00,CHHICHHIBO,LORN SREY LEAK,1,3.000
999997,2023-12-01T00:00,SREYLEAKLORN,LORN SREY LEAK,7,6.675
999998,2023-12-01T00:00,SAVINDAN,LORN SREY LEAK,1,2.500

<hr>
Clean ABA Data
<hr>

In [8]:
aba_data.tail()

               AC_NAME
999995  LOEUM SOCHETRA
999996   LOEUM SOCHITA
999997     LOEUM SOHEM
999998     LOEUM SOKAL
999999    LOEUM SOKHAY

In [9]:
aba_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 1 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   AC_NAME  1000000 non-null  object
dtypes: object(1)
memory usage: 7.6+ MB

In [10]:
aba_data['AC_NAME'] = aba_data['AC_NAME'].str.upper()
aba_data['AC_NAME'] = aba_data['AC_NAME'].str.strip()
aba_data['AC_NAME'] = aba_data['AC_NAME'].str.replace(" ", "")

In [11]:
aba_data.tail()

              AC_NAME
999995  LOEUMSOCHETRA
999996   LOEUMSOCHITA
999997     LOEUMSOHEM
999998     LOEUMSOKAL
999999    LOEUMSOKHAY

<hr>
Matching Algo
<hr>

In [12]:
!pip install rapidfuzz

Requirement already satisfied: rapidfuzz in d:\aba_bank\ad_hoc\khqr_aba_cust_matching\.venv\lib\site-packages (3.6.1)

WARNING: You are using pip version 22.0.4; however, version 23.3.2 is available.
You should consider upgrading via the 'D:\ABA_Bank\AD_HOC\KHQR_ABA_Cust_Matching\.venv\Scripts\python.exe -m pip install --upgrade pip' command.

In [13]:
from rapidfuzz import fuzz as rf

# Token Sort Ratio is useful when word order might vary

def isABACustomer(str1,str2):
    return rf.token_sort_ratio(str1, str2)
    # return fuzz.token_sort_ratio(row['src_name'], row['MerchantName'])

In [18]:
#concate the dataframe 
data = pd.DataFrame({"bakong_cust" : bakong_data['src_name'] , "aba_cust" : aba_data['AC_NAME']})
data.head()

    bakong_cust                    aba_cust
0       SINVORN   PENGKHEANGANDCHOUMUYSORTH
1    PUNLORKSUM                   ROSPHEARA
2  KOEMHENGKONG  CAMBODIACANAANORGANIZATION
3    PISETHTORN        MELPHEAROMANDHOKBORA
4   LYHENGCHERM                 TESTITSORYA

In [ ]:
import pandas as pd
from rapidfuzz import fuzz
import datetime

results = []
start = datetime.datetime.now()
print(start)

for item_a in data['bakong_cust']:
        for item_b in data['aba_cust']:
            score = fuzz.token_set_ratio(str(item_a), str(item_b))
            results.append({'bakong_cust': item_a, 'aba_cust': item_b, 'score': score})            
end = datetime.datetime.now()
print(start)

print(end - start)
results_df = pd.DataFrame(results)


results_df.head()

2024-01-23 22:40:37.407878